; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v5 ?v8)
             (pred_2 ?v4 ?v13)
             (pred_1 ?v5 ?v13)
             (pred_3 ?v2 ?v5 )
	     (pred_11 ?v5)
             (pred_7 ?v9)
             (pred_9 ?v4)
             (pred_6 ?v13)
             (pred_4 ?v5)
             (pred_8 ?v4)
             (pred_5 ?v5)
             (pred_10 ))



(:action op_3
:parameters (?v10 ?v3 ?v1 ?v11)
:precondition (and (pred_7 ?v10) (pred_7 ?v3) (pred_9 ?v1) (pred_6 ?v11)
          (pred_12 ?v10 ?v3) (pred_2 ?v1 ?v11)
                   (pred_1 ?v3 ?v11) (pred_11 ?v10) 
                   (pred_4 ?v3) (pred_8 ?v1))
:effect (and  (pred_5 ?v3) (not (pred_4 ?v3))))


(:action op_2
:parameters (?v10 ?v7)
:precondition (and (pred_7 ?v10) (pred_7 ?v7)
               (pred_11 ?v10) (pred_12 ?v10 ?v7) (pred_5 ?v7))
:effect (and (pred_11 ?v7) (not (pred_11 ?v10))))

(:action op_4
:parameters (?v10 ?v1)
:precondition (and (pred_7 ?v10) (pred_9 ?v1) 
                  (pred_11 ?v10) (pred_3 ?v1 ?v10) (pred_10 ))
:effect (and (pred_8 ?v1)
   (not (pred_3 ?v1 ?v10)) (not (pred_10 ))))


(:action op_1
:parameters (?v10 ?v6 ?v12)
:precondition (and (pred_7 ?v10) (pred_9 ?v6) (pred_9 ?v12)
                  (pred_11 ?v10) (pred_8 ?v12) (pred_3 ?v6 ?v10))
:effect (and (pred_8 ?v6) (pred_3 ?v12 ?v10)
        (not (pred_8 ?v12)) (not (pred_3 ?v6 ?v10))))

(:action op_5
:parameters (?v10 ?v1)
:precondition (and (pred_7 ?v10) (pred_9 ?v1) 
                  (pred_11 ?v10) (pred_8 ?v1))
:effect (and (pred_10 ) (pred_3 ?v1 ?v10) (not (pred_8 ?v1)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_08 obj_13 obj_03 obj_17 obj_15 obj_02 obj_10 obj_09 obj_12 obj_06 obj_07 obj_21 obj_16 obj_11 obj_18 obj_14
    obj_19 obj_05
    obj_20 obj_04 obj_01
    )

    (:init
       (pred_10)

       (pred_7 obj_08)
       (pred_7 obj_13)
       (pred_7 obj_03)
       (pred_7 obj_17)
       (pred_7 obj_15)
       (pred_7 obj_02)
       (pred_7 obj_10)
       (pred_7 obj_09)
       (pred_7 obj_12)
       (pred_7 obj_06)
       (pred_7 obj_07)
       (pred_7 obj_21)
       (pred_7 obj_16)
       (pred_7 obj_11)
       (pred_7 obj_18)
       (pred_7 obj_14)
       (pred_6 obj_19)
       (pred_6 obj_05)
       (pred_9 obj_20)
       (pred_9 obj_04)
       (pred_9 obj_01)

       (pred_12 obj_08 obj_15)
       (pred_12 obj_08 obj_13)
       (pred_12 obj_13 obj_02)
       (pred_12 obj_13 obj_03)
       (pred_12 obj_13 obj_08)
       (pred_12 obj_03 obj_10)
       (pred_12 obj_03 obj_17)
       (pred_12 obj_03 obj_13)
       (pred_12 obj_17 obj_09)
       (pred_12 obj_17 obj_03)
       (pred_12 obj_15 obj_12)
       (pred_12 obj_15 obj_02)
       (pred_12 obj_15 obj_08)
       (pred_12 obj_02 obj_06)
       (pred_12 obj_02 obj_10)
       (pred_12 obj_02 obj_13)
       (pred_12 obj_02 obj_15)
       (pred_12 obj_10 obj_07)
       (pred_12 obj_10 obj_09)
       (pred_12 obj_10 obj_03)
       (pred_12 obj_10 obj_02)
       (pred_12 obj_09 obj_21)
       (pred_12 obj_09 obj_17)
       (pred_12 obj_09 obj_10)
       (pred_12 obj_12 obj_16)
       (pred_12 obj_12 obj_06)
       (pred_12 obj_12 obj_15)
       (pred_12 obj_06 obj_11)
       (pred_12 obj_06 obj_07)
       (pred_12 obj_06 obj_02)
       (pred_12 obj_06 obj_12)
       (pred_12 obj_07 obj_18)
       (pred_12 obj_07 obj_21)
       (pred_12 obj_07 obj_10)
       (pred_12 obj_07 obj_06)
       (pred_12 obj_21 obj_14)
       (pred_12 obj_21 obj_09)
       (pred_12 obj_21 obj_07)
       (pred_12 obj_16 obj_11)
       (pred_12 obj_16 obj_12)
       (pred_12 obj_11 obj_18)
       (pred_12 obj_11 obj_06)
       (pred_12 obj_11 obj_16)
       (pred_12 obj_18 obj_14)
       (pred_12 obj_18 obj_07)
       (pred_12 obj_18 obj_11)
       (pred_12 obj_14 obj_21)
       (pred_12 obj_14 obj_18)
       (pred_4 obj_21)
       (pred_4 obj_13)
       (pred_4 obj_07)
       (pred_1  obj_21 obj_19)
       (pred_1  obj_13 obj_05)
       (pred_1  obj_07 obj_05)
       (pred_5 obj_08)
       (pred_5 obj_03)
       (pred_5 obj_17)
       (pred_5 obj_15)
       (pred_5 obj_02)
       (pred_5 obj_10)
       (pred_5 obj_09)
       (pred_5 obj_12)
       (pred_5 obj_06)
       (pred_5 obj_16)
       (pred_5 obj_11)
       (pred_5 obj_18)
       (pred_5 obj_14)

       (pred_2  obj_20 obj_19)
       (pred_2  obj_04 obj_05)
       (pred_2  obj_01 obj_05)
       (pred_3 obj_20 obj_12)
       (pred_3 obj_04 obj_16)
       (pred_3 obj_01 obj_18)
       (pred_11 obj_18)
    )

    (:goal (and
       (pred_3 obj_20 obj_16)
       (pred_3 obj_04 obj_03)
       (pred_3 obj_01 obj_16)
    ))
(:constraints
  (always (not (pred_11 obj_15)))
)
)

; plan
1. (op_4 obj_18 obj_01)
   deleted: (pred_3 obj_01 obj_18) (pred_10)
   added: (pred_8 obj_01)
   goals met: 0 of 3
2. (op_2 obj_18 obj_11)
   deleted: (pred_11 obj_18)
   added: (pred_11 obj_11)
   goals met: 0 of 3
3. (op_2 obj_11 obj_16)
   deleted: (pred_11 obj_11)
   added: (pred_11 obj_16)
   goals met: 0 of 3
4. (op_1 obj_16 obj_04 obj_01)
   deleted: (pred_8 obj_01) (pred_3 obj_04 obj_16)
   added: (pred_8 obj_04) (pred_3 obj_01 obj_16)
   goals met: 1 of 3
5. (op_2 obj_16 obj_12)
   deleted: (pred_11 obj_16)
   added: (pred_11 obj_12)
   goals met: 1 of 3
6. (op_1 obj_12 obj_20 obj_04)
   deleted: (pred_8 obj_04) (pred_3 obj_20 obj_12)
   added: (pred_8 obj_20) (pred_3 obj_04 obj_12)
   goals met: 1 of 3
7. (op_2 obj_12 obj_16)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_16)
   goals met: 1 of 3
8. (op_5 obj_16 obj_20)
   deleted: (pred_8 obj_20)
   added: (pred_10) (pred_3 obj_20 obj_16)
   goals met: 2 of 3
9. (op_2 obj_16 obj_12)
   deleted: (pred_11 obj_16)
   added: (pred_11 obj_12)
   goals met: 2 of 3
10. (op_4 obj_12 obj_04)
   deleted: (pred_3 obj_04 obj_12) (pred_10)
   added: (pred_8 obj_04)
   goals met: 2 of 3
11. (op_2 obj_12 obj_06)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_06)
   goals met: 2 of 3
12. (op_2 obj_06 obj_02)
   deleted: (pred_11 obj_06)
   added: (pred_11 obj_02)
   goals met: 2 of 3
13. (op_2 obj_02 obj_10)
   deleted: (pred_11 obj_02)
   added: (pred_11 obj_10)
   goals met: 2 of 3
14. (op_2 obj_10 obj_03)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_03)
   goals met: 2 of 3
15. (op_5 obj_03 obj_04)
   deleted: (pred_8 obj_04)
   added: (pred_10) (pred_3 obj_04 obj_03)
   goals met: 3 of 3
